{
    "Bienvenido":"Welcome",
    "INFORMACION":"Information",
    "COMPROBANDO":"Checking...",
    "EN_CURSO":"In progress...",
    "EXITO_SWAL":"All good!",
    "BTN_ENTIENDO":"I understand",
    "BTN_GRD_CAMBIO":"Save Changes",
    "BTN_CRG_ORIGINAL":"Load Original",
    "BTN_CANCELAR":"Cancel",
    "DESEAS_CONTINUAR":"Do you wish to continue?",
    "BTN_CONFIRMAR":"Yes, proceed",

    "ELIMINAR_TOKEN":"This will delete the stored AI token. Are you sure you want to proceed?",
    "TOKEN_ELIMINADO":"You have successfully deleted the token.",













    "MSG_BIENVENIDA":"To get started with HakaBoost, check out the settings section, where you can connect to OpenAI/Gemini, Jira, and XRAY (optional). You can use the <?> buttons for additional information.",
    "MSG_ESPERA":"We are checking that everything is working correctly, please wait....",
    
    "MSG_JIRA_ERROR1":"You must complete all Jira data.",
    "MSG_JIRA_ERROR2":"Unable to read the page description. You must be in a Jira issue..",
    "MSG_JIRA_ERROR3":"It looks like you created this improved description in another issue. You can't update the current page. We'll clean everything up.",
    "MSG_JIRA_ERROR4":"You must first generate an improved description from the Improve Desc button.",
    "MSG_JIRA_ERROR5":"The current issue key was not detected, please try again.",
    "MSG_JIRA_ERROR6":"We were unable to connect to Jira, please review your data and try again.",
    "MSG_JIRA_ISSUE_INVALIDA":"You must be on a valid JIRA issue to improve the description.",
    "MSG_JIRA_ERROR_NO_DESCRIPCION":"There's no description in the issue to improve. (Make sure you're not editing the description.)",
    "MSG_JIRA_NOCRED":"Jira credentials are missing",
    "MSG_JIRA_NOCRED2":"You must first configure your Jira credentials in the configuration panel.",
    "MSG_JIRA_ERRORCRED":"The description in Jira hasn't been updated. Are your credentials correct?",
    "MSG_JIRA_ENCURSO":"Please wait, we are updating the description in Jira...",
    "MSG_JIRA_EXITO":"The description in Jira has been updated. <strong>To see the changes, you must refresh the page.</strong>",
    "MSG_JIRA_LEYENDO":"We're trying to read data from Jira. Please wait.",
    "MSG_JIRA_ONLY":"To use HakaBoost correctly the browser must be in a valid task.",
    "MSG_JIRA_INFO_LINK":"To link issues as <strong>Test (tests, is tested by)</strong> (to the main task) you must have this type of link available in your project, plugins like XRAY create this link by default. <br>If this type of link fails, we will automatically link the created tests as <strong>Relates</strong>.",
    "MSG_JIRA_INFO_CREATE":"By default, we'll try to create issues for test scenarios as <strong>Test</strong> issues. <br> <strong>If your project doesn't have this issue type, please specify another</strong>. If this fails, we'll create the scenarios as Tasks.",
    "MSG_JIRA_EXITO_CONN":"We have successfully saved the JIRA API usage settings for your account: ",
    "MSG_JIRA_CHANGE_TYPE":"This allows you to change the issue type that TestHunt creates in Jira.<br><strong>Only change this value to a valid Jira issue name (literal)</strong><br>Specifying a non-existent issue type will result in an error.<br>To save the change, press the Save Jira button",
    
    "MSG_XRAY_ERROR1":"You must enter Client Id and Secret",
    "MSG_XRAY_ERROR2":"We were unable to authenticate your XRAY data, please review it.",

    "MSG_IA_ERROR1":"You must enter the Google (Gemini) token in the configuration panel.",
    "MSG_IA_MEJORA":"Improving description with AI (Gemini).",
    "MSG_IA_MEJORA_CHROME":"Improving description with AI (Chrome built-in AI).",
    "MSG_IA_ESPERA":"Please wait, depending on the AI ​​model used, this may take a while.",
    "MSG_IA_MEJORA_OK":"The description has been improved. If you want to bring it to Jira, use the Update Jira button.\n\nRemember that this improvement was created by generative AI, review the result and correct any errors.",
    "MSG_IA_MODEL_OK":"The selected model has been successfully stored.",
    "MSG_IA_DATA_OK":"AI data has been successfully stored.",
    "MSG_IA_ERROR_MEJORA":"Error improving description. The model or AI may not be available.",
    "MSG_IA_GEMINI_ERROR1":"The model used in Gemini is overloaded. Please try again later.",
    "MSG_IA_GEMINI_ERROR2":"You have exceeded the request limit (rate limit). Please wait a moment and try again.",
    "MSG_IA_GEMINI_ERROR3":"There's a problem using Gemini. Please try again later: ",
    "MSG_IA_OPENAI_ERROR1":"You must enter the OpenAI token in the configuration panel.",
    "MSG_IA_MEJORA_OPENAI":"Improving description with AI (OpenAI).",
    "MSG_IA_PREPROMT":"Improve this Jira description:",
    "MSG_IA_ELIMINA_TOKEN":"You have successfully deleted the token.",
    "MSG_IA_OPENAI_ERROR_TOKEN":"The token doesn't look correct or the model isn't enabled in your OpenAI account.",
    "MSG_IA_GUARDADO_OK":"The data has been saved, your account looks correct.",

    "MSG_CREATE_ERROR1":"You must be on a valid Jira issue to create tests.",
    "MSG_CREATE_ERROR2_NO_ESCENARIOS":"There are no scenarios (Scenario) in gherkin format (actually) in Jira description, check if the description is in edit mode, if so, save the changes before trying this.",
    "MSG_CREATE_ERROR_NOTEST":"You must select at least one test from the list to create.",
    "MSG_CREATE_ERROR_GENERAL":"A problem occurred while creating the tests. Please refresh the current issue in Jira and review it before trying again.",
    "MSG_CREATE_SEL":"Only the tests selected with a check mark will be created and linked to the main issue.",
    "MSG_CREATE_SI":"Yes, create",
    "MSG_CREATE_INPROGRESS":"Creating Tests in Jira",
    "MSG_CREATE_ERROR_NOISSUEKEY":"We couldn't find the Jira IssueKey, you must be on a valid Jira issue.",
    "MSG_ERROR_NO_JIRA":"To use this feature you must enter your Jira credentials.",
    "MSG_ERROR_NO_XRAY": "Xray Cloud credentials (client_id / client_secret) are missing to create the tests. Please re-enter them and try again. (Also, refresh the issue in Jira and check if the tests have been created)",
    "MSG_ERROR_COD_0":"Error creating issue. The task type may not be available in Jira. Check your settings.",
    "MSG_ERROR_COD_400":"Error creating issue (400). Check that the issue type exists in your project.",
    "MSG_ERROR_COD_401":"You do not have permission to create issues in Jira via the REST API.",
    "MSG_ERROR_COD_402":"Review your connection details for the Jira API.",
    "MSG_CREATE_OK": "The test has been created",
    "MSG_CREATE_SCENARI_IS":"The scenario is: ",
    "MSG_CREATE_CHANGE":"has been modified as",
    "MSG_CREATE_GHERKIN":"the gherkin has been added.",
    "MSG_CREATE_LINKING":"Linking",
    "MSG_CREATE_AND_LINKED": "Done. The test(s) have been created and linked.",
    "MSG_CREATE_FINAL_CONFIRMED":"All issues have been linked to the selected task. Refresh the issue to see the changes.",
    "MSG_CREATE_INTERNAL":"Created by",
    "MSG_CREATE_ERROR_ISSUE_TYPE":"The specified issue type does not appear to exist in the project, the issue will be created as a Task",
    "MSG_CREATE_ERROR_LINKED":"Error linking issues, you'll have to do it manually.",
    "MSG_CREATE_ERROR_JIRA":"There is no active Jira tab",
    "MSG_CREATE_ERROR_NO_DESCRIPTION":"Error reading the description.",
    "MSG_CREATE_NO_ISSUETYPES":"Could not get list of fields to locate Test Type",
    "MSG_CREATE_ERROR_NO_TEST_TYPE":"I didn't find the Test Type field in your Jira (Xray).",
    "MSG_CREATE_ERROR_INUPDATE_TYPE_XRAY":"Failed to update Test Type to",
    "MSG_CREATE_PARA":"for",
    "MSG_CREATE_NO_BODY_SCENARIO":"After cleaning, the gherkin was empty (did it only have the stage title?).",
    "MSG_CREATE_NO_BEARER_XRAY":"We were unable to create the XRAY token. Please check your connection information. (Bearer Xray)",
    "MSG_CREATE_ERROR_JIRA_DATA":"JIRA connection data is missing, please check that it is configured correctly.",
    "MSG_CREATE_NO_IDKEY":"The idOrKey of the issue is missing.",
    "MSG_CREATE_NO_XRAY_CRED":"Xray Cloud credentials are missing. Check if they are configured correctly and try again. (Refresh the current issue in Jira and check if the tasks have been created.)",
    "MSG_CREATE_ERROR_EXPORT_CUCUMBER":"Error exporting feature",

    "MSG_ERROR_SWAL": "Houston, we have a problem",
    "MSG_ERROR_SWAL2":"Error in the Matrix",
    "MSG_ERROR_SWAL3":"Not so fast",
    "MSG_ERROR_ONLYJIRA":"This plugin works only in Jira.",
    
    "EXITO_DELETE_CRED":"Credentials successfully removed.",
    "EXITO_XRAY_SAVE":"Xray Data Stored Correctly,",

    "MSG_AYUDA1": "<p><strong>Improve Description:</strong> Uses AI to formulate an improvement option for the description in Jira. </p><p><strong>Create Tests:</strong> Automatically creates tests (issues) based on the current description in Jira. The description must contain 'Scenarios' in gherkin.</p><p><strong>Update Jira:</strong> Updates the description in Jira with the AI-enhanced version. </p>",

    "PROMP_TITULO":"Prompt configuration",
    "PROMP_EXPLI":"<p style='margin: 10px 0 15px 0; font-size:13px;'>Here you can add a custom prompt. <strong>If you do this</strong> it will be used instead of our original logic. You can also return to the original prompt at any time using the Load Original button.</p>",
    "PROMP_ACTUALIZADO":"Prompt updated",
    "PROMP_MSG_EXITO":"The new prompt has been saved successfully. If it doesn't work, try returning to the original prompt.",
    "PROMP_MSG_ERROR":"You must store a minimally valid text prompt. We won't store this prompt to avoid annoying the AI.",
    "PROMP_MSG_REST":"Original Prompt Restored",

    "COFFEE_TITULO":"Buy the developer a coffee",
    "COFFEE_MSG":"Is HakaBoost helpful? Buy the developer a coffee to relieve insomnia.",
    "COFFEE_BTN":"Invite a coffee",

    "REGISTER_1":"To continue, we need some data.",
    "REGISTER_2":"This is just to get to know our users — no spam, we promise.",
    "REGISTER_3":"Name",
    "REGISTER_4":"Company",
    "REGISTER_5":"Save",
    "REGISTER_ERROR":"All fields are required.",
    "REGISTER_ERROR2":"You must enter a valid email address.",
    "REGISTER_COMPLETE":"Registration complete. <br>To finish, you must close and reopen HakaBoost (we will try to do this automatically). If this doesn't happen, please close it.",
    "REGISTER_ERROR_3":"We're having trouble connecting to our headquarters, please try again. (If you have a VPN, it might be a good time to disable it while you log in.)",
    "MSG_MAIL_ERROR1":"You must specify your email in a valid format.",

    "PROMPT_ORG":"You are a QA expert whose job is to improve user stories in Jira. RESPOND only with the formatted result; do not include explanations, instructions, or repeat this prompt in the output. INPUT: You will receive a 'Description' (text in any language). Use that text exactly as given. OUTPUT (mandatory rules): 1. The output must start exactly with the Description I give you, on the first line, without changes, prefixes, or additions. 2. Immediately after include the block titled: Acceptance Criteria: - List only the clear and precise acceptance criteria derived from the Description. - Each criterion on its own line. Do not add explanations or examples. - Create as many criteria as you deem necessary to fulfill the description. 3. leave two blank lines, For each acceptance criterion listed, include at least one scenario per generated acceptance criterion in Gherkin format; each scenario must include the following: - Scenarios must use Gherkin keywords ALWAYS in ENGLISH: Scenario, Scenario Outline, Examples, Given, When, Then, And, But, (other Gherkin keywords in English if applicable). - All other text (titles, steps, sentences) must be in the same language as the description (i.e., if the description is in English, do everything in English. If (and only if) the description is in Spanish, follow the rule of Gherkin keywords in English). - Do not use bold, double asterisks, code blocks, Markdown headers, or decorative symbols. Plain text only. 5. Do not add anything outside those blocks. Do not include comments, repeat instructions, or create additional sections (for example: \"Notes\", \"Explanation\", \"Summary\"). 6. Do not use symbols such as **, ```, #, or any Markdown formatting. Avoid unnecessary decorative quotation marks. 7. You must create at least 1 scenario for each acceptance criterion. END. Now process the description I give you and generate the output following the rules above exactly.",

    "HTML_MAIN_TITLE":"HakaLab Testing Copilot",
    "HTML_MAIN_COPILOTO":"Copilot",
    "HTML_MAIN_CONFIGURACIONES":"Configurations",
    "HTML_LABEL_ESTADO":"State",
    "HTML_LABEL_TITULO":"Resume",
    "HTML_BTN_LEERDESCRIPCION":"Read current description ",
    "HTML_BTN_MEJORARDESCRIPCION":"Improve Desc. <i class='fa fa-cogs'></i>",
    "HTML_BTN_CREARTEST":"Suggest Tests <i class='fa fa-bolt'></i>",
    "HTML_LABEL_DESCR_ORIGINAL":"Original description",
    "HTML_LABEL_DESCR_MEJORADA":"Improve description",

    "HTML_LABEL_MEJORAR_JIRA":"Update Jira <i class='fa fa-rocket'></i>",
    "HTML_LABEL_AVISO_TESTACREAR":"The following tests will be created in Jira:",
    "HTML_LAVEL_AVISO_LINK":"By default, these tests are linked (depending on your configuration) to the current Jira issue. You can change this from the 'Main Issue' option.",
    "HTML_LABEL_AVISO_MAIN":"Main Issue",
    "HTML_BTN_CREARJIRA":"Create in Jira <i class='fa fa-cloud-upload' aria-hidden='true'></i>",
    "HTML_LABEL_AVISODATOS":"<strong>Important:</strong> This data is used locally only.",
    "HTML_LABEL_AJUSTES_IA":"<strong>AI Settings</strong>",
    "HTML_LABEL_IASELECCION":"IA Selecction:",
    "HTML_LABEL_SELECCIONMODELO":"Select OpenAI model",
    "HTML_LABEL_SELECCIONMODELOGEM":"Select Gemini model",
    "HTML_LABEL_AJUSTESIA":"<strong>Jira Settings</strong>",
    
    "HTML_LABEL_USOJIRA":"Used to: 1) Automatically replace the description with the AI-suggested improvement. 2) Suggest tests based on the current Jira description.",
    "HTML_LABEL_TIPOISSUE":"Issue type to create",
    "HTML_LABEL_LINKTYPE":"Type of Link",
    "HTML_LABEL_XRAYTITLE":"<strong>Xray Settings (Optional)</strong>",
    "HMLT_LABEL_XRAY_DESCRIP":"Used to: 1) Set the test type (Cucumber or Manual) 2) Add the scenario gherkin to Cucumber type tests",
    "HTML_LABEL_HAKA":"Visit us <a style='color: white;' href='https://hakalab.com/'>https://hakalab.com</a>",
    "MSG_IACHROME_WAIT":"Please wait, this AI may take a couple of seconds, do not close this view.",
    "MSG_FIST_INSTRUCTION":"You are an expert in software quality and testing.",
    "DESCRIPTION": "Description",
    "MSG_CHROMEIA_NOT":"No available model found for CHROME BUILT-IN IA. Check the console for more details."
}