{
    "Bienvenido":"Bienvenido",
    "INFORMACION":"Información",
    "COMPROBANDO":"Comprobando...",
    "EN_CURSO":"En proceso...",
    "EXITO_SWAL":"Todo bien!",
    "BTN_ENTIENDO":"Entiendo",
    "BTN_GRD_CAMBIO":"Guardar Cambios",
    "BTN_CRG_ORIGINAL":"Cargar Original",
    "BTN_CANCELAR":"Cancelar",
    "DESEAS_CONTINUAR":"¿Deseas continuar?",
    "BTN_CONFIRMAR":"Sí, confirmar",

    "ELIMINAR_TOKEN":"Esto eliminará el token almacenado de OpenAI/Gemini. ¿Estás seguro?",
    "TOKEN_ELIMINADO":"Has eliminado el token exitosamente.",










    "MSG_BIENVENIDA":"Para comenzar a utilizar HakaBoost revisa la sección de configuraciones, allí podrás conectar con OpenAI/Gemini, Jira y XRAY(Opcional). Puedes utilizar los botones de ? para obtener información adicional.",
    "MSG_ESPERA":"Estamos revisando que todo funcione correctamente, por favor espera...",
    
    "MSG_JIRA_ERROR1":"Debes completar todos los datos de Jira.",
    "MSG_JIRA_ERROR2":"No se puede leer la descripción de la página. Debes estar en una issue de Jira.",
    "MSG_JIRA_ERROR3":"Al parecer esta descripción mejorada la creaste en otra issue. No puedes actualizar en la página actual. Intentaremos limpiar todo",
    "MSG_JIRA_ERROR4":"Primero debes generar una descripción mejorada desde el botón Mejorar Desc.",
    "MSG_JIRA_ERROR5":"No se detectó la clave del issue actual, é.",
    "MSG_JIRA_ERROR6":"No logramos establecer la conexión con Jira, revisa los datos y reinténtalo.",
    "MSG_JIRA_ISSUE_INVALIDA":"Debes estar en una issue válida de jira para mejorar la descripción",
    "MSG_JIRA_ERROR_NO_DESCRIPCION":"No hay descripción en la issue para mejorar (asegúrate de NO estar editando la descripción)",
    "MSG_JIRA_NOCRED":"Faltan credenciales Jira",
    "MSG_JIRA_NOCRED2":"Primero debes configurar tus credenciales Jira en el panel de configuración.",
    "MSG_JIRA_ERRORCRED":"No se la logrado actualizar la descripción en Jira. Tus credenciales son correctas?",
    "MSG_JIRA_ENCURSO":"Por favor espera, estamos actualizando la descripción en Jira...",
    "MSG_JIRA_EXITO":"Se ha actualizado la descripción en Jira. <strong>Para ver los cambios debes refrescar la página.</strong>",
    "MSG_JIRA_LEYENDO":"Estamos intentando leer los datos de Jira. Por favor espera.",
    "MSG_JIRA_ONLY":"Para utilizar HakaBoost correctamente el navegador debe estar en una tarea válida.",
    "MSG_JIRA_INFO_LINK":"Para vincular los issues como <strong>Test (tests, is tested by)</strong> (a la tarea principal) debes tener este tipo de vinculación disponible en tu proyecto, plugins como XRAY crean este vínculo por defecto. <br>En caso de fallar la vinculación de este tipo, vincularemos automáticamente los test creados como <strong>Relates</strong>.",
    "MSG_JIRA_INFO_CREATE":"Por defecto intentaremos crear los issues para los escenarios de prueba como issues de tipo <strong>Test</strong>. <br> <strong>Si tu proyecto no tiene este tipo de issue por favor especifica otro</strong>. En caso de error, crearemos los escenarios como una Tarea (Task).",
    "MSG_JIRA_EXITO_CONN":"Hemos guardado correctamente la configuración del uso de JIRA API para tu cuenta: ",
    "MSG_JIRA_CHANGE_TYPE":"Esto te permite cambiar el tipo de tarea (Issue) que TestHunt crea en Jira.<br><strong>Solo cambia este valor por un nombre (Literal) de tarea válido de Jira</strong><br>Si especificas un tipo de tarea no existente se producirá un error.<br>Para almacenar el cambio presiona el botón <Guardar Jira>",
    
    "MSG_XRAY_ERROR1":"Debes ingresar Client Id y Secret",
    "MSG_XRAY_ERROR2":"No hemos podido autenticar tus datos de XRAY, por favor revísalos.",

    "MSG_IA_ERROR1":"Debes ingresar el token de Google (Gemini) en el panel de configuración",
    "MSG_IA_MEJORA":"Mejorando la descripción con IA (Gemini).",
    "MSG_IA_ESPERA":"Por favor espera, dependiendo del modelo de IA utilizado, esto puede tardar.",
    "MSG_IA_MEJORA_OK":"La descripción se ha mejorado. Si quieres llevarla a jira utiliza el botón Actualizar Jira.\n\nRecuerda que esta mejora fue creada por una IA generativa, revisa el resultado y corrige cualquier error.",
    "MSG_IA_MODEL_OK":"Se ha almacenado exitosamente el modelo seleccionado.",
    "MSG_IA_DATA_OK":"Se han almacenado correctamente los datos de IA",
    "MSG_IA_ERROR_MEJORA":"Error al mejorar la descripción. Puede que el modelo o IA no estén disponibles.",
    "MSG_IA_GEMINI_ERROR1":"El modelo utilizado en Gemini está sobrecargado. Intenta nuevamente en un momento.",
    "MSG_IA_GEMINI_ERROR2":"Has excedido el límite de peticiones (rate limit). Espera un poco y vuelve a intentar.",
    "MSG_IA_GEMINI_ERROR3":"Hay un problema al utilizar Gemini. Inténtalo más tarde: ",
    "MSG_IA_OPENAI_ERROR1":"Debes ingresar el token de OpenAI en el panel de configuración",
    "MSG_IA_MEJORA_OPENAI":"Mejorando la descripción con IA (OpenAI).",
    "MSG_IA_PREPROMT":"Mejora esta descripción de Jira:",
    "MSG_IA_ELIMINA_TOKEN":"Haz eliminado exitosamente el token",
    "MSG_IA_OPENAI_ERROR_TOKEN":"El token no parece correcto o el modelo no está habilitado en tu cuenta de OpenAI",
    "MSG_IA_GUARDADO_OK":"Se han almacenado los datos, tu cuenta parece correcta.",

    "MSG_CREATE_ERROR1":"Debes estar en una issue válida de jira para crear tests.",
    "MSG_CREATE_ERROR2_NO_ESCENARIOS":"No hay escenarios (Scenario) en formato gherkin en la descripción actual de Jira (si generaste una mejora, actualiza esta en jira antes de hacer esto), revisa si la descripción está en modo edición, si es así, guarda los cambios antes de intentar esto.",
    "MSG_CREATE_ERROR_NOTEST":"Debes seleccionar al menos un test del listado para crear",
    "MSG_CREATE_ERROR_GENERAL":"Ocurrió un problema al crear los tests. Por favor, antes de reinténtarlo refresca el issue actual en Jira y revisa.",
    "MSG_CREATE_SEL":"Se crearán solo los tests seleccionados con check y se enlazarán al issue principal.",
    "MSG_CREATE_SI":"Sí, crear",
    "MSG_CREATE_INPROGRESS":"Creando Tests en Jira",
    "MSG_CREATE_ERROR_NOISSUEKEY":"No encontramos el IssueKey de Jira, debes estar en un issue válido de Jira.",
    "MSG_ERROR_NO_JIRA":"Para utilizar esta funcionalidad debes ingresar tus credenciales de Jira",
    "MSG_ERROR_NO_XRAY": "Faltan credenciales de Xray Cloud (client_id / client_secret) para crear los test, por favor reingresa la credenciales e inténtalo nuevamente. (De igual forma, refresca el issue en Jira y comprueba si los test se han creado)",
    "MSG_ERROR_COD_0":"Error al crear el issue. Puede que el tipo de tarea no esté disponible en Jira. Revisa la configuración.",
    "MSG_ERROR_COD_400":"Error al crear el issue (400). Revisa que el issue type exista en tu proyecto.",
    "MSG_ERROR_COD_401":"No tienes permisos para crear issues en Jira vía API REST.",
    "MSG_ERROR_COD_402":"Revisa tus datos de conexión para la API de Jira.",
    "MSG_CREATE_OK": "Se ha creado el test",
    "MSG_CREATE_SCENARI_IS":"El escenario es: ",
    "MSG_CREATE_CHANGE":"se ha modificado como",
    "MSG_CREATE_GHERKIN":"se le ha agregado el gherkin.",
    "MSG_CREATE_LINKING":"Vinculando",
    "MSG_CREATE_AND_LINKED": "Listo. Se ha(n) creado y vinculado el(los) test(s)",
    "MSG_CREATE_FINAL_CONFIRMED":"Se han vinculado todo los issues a la tarea seleccionada, refresca el issue para ver los cambios.",
    "MSG_CREATE_INTERNAL":"Creado por",
    "MSG_CREATE_ERROR_ISSUE_TYPE":"El issue type especificado parece no existir en el proyecto, se creará el issue como Task",
    "MSG_CREATE_ERROR_LINKED":"Error al vincular los issues, tendrás que hacerlo manualmente.",
    "MSG_CREATE_ERROR_JIRA":"No hay una pestaña de Jira activa",
    "MSG_CREATE_ERROR_NO_DESCRIPTION":"Error en la lectura de la descripción.",
    "MSG_CREATE_NO_ISSUETYPES":"No se pudo obtener la lista de campos para localizar el Test Type",
    "MSG_CREATE_ERROR_NO_TEST_TYPE":"No encontré el campo <Test Type> en tu Jira (Xray).",
    "MSG_CREATE_ERROR_INUPDATE_TYPE_XRAY":"Fallo al actualizar Test Type a",
    "MSG_CREATE_PARA":"para",
    "MSG_CREATE_NO_BODY_SCENARIO":"Tras limpiar, el gherkin quedó vacío (¿sólo tenía el título del escenario?).",
    "MSG_CREATE_NO_BEARER_XRAY":"No logramos crear el TOKEN de XRAY, revisa tus datos de conexión. (Bearer Xray)",
    "MSG_CREATE_ERROR_JIRA_DATA":"Faltan datos de la conexión de JIRA, por favor revisa que estén configurados correctamente.",
    "MSG_CREATE_NO_IDKEY":"Falta el idOrKey de la issue.",
    "MSG_CREATE_NO_XRAY_CRED":"Faltan credenciales de Xray Cloud revisa si están bien configuradas y reinténtalo. (Refresca el issue actual en Jira y revisa si las tareas se crearon)",
    "MSG_CREATE_ERROR_EXPORT_CUCUMBER":"Error exportando feature",

    "MSG_ERROR_SWAL": "Houston, tenemos un problema",
    "MSG_ERROR_SWAL2":"Error en la Matrix",
    "MSG_ERROR_SWAL3":"No tan rápido",
    "MSG_ERROR_ONLYJIRA":"Este complemento funciona solamente en Jira.",
    
    "EXITO_DELETE_CRED":"Credenciales eliminadas correctamente.",
    "EXITO_XRAY_SAVE":"Datos de Xray Almacenados correctamente,",

    "MSG_AYUDA1": "<p><strong>Mejorar Descripción:</strong> Utiliza IA para formular un opción de mejora para la descripción en Jira. </p><p><strong>Sugerir Tests:</strong> Crea tests (issues) de forma automática basándose en la descrición actual en Jira. La descripción debe contener 'Scenarios' en gherkin</p><p><strong>Actualizar Jira:</strong> Actualiza la descripción en Jira por la versión mejorada con IA. </p>",

    "PROMP_TITULO":"Configuración del prompt",
    "PROMP_EXPLI":"<p style='margin: 10px 0 15px 0; font-size:13px;'>Aquí puedes añadir un Prompt personalizado, <strong>si lo haces</strong> se utilizará esté en lugar de nuestra lógica original. De igual forma, en cualquier momento puedes volver al prompt original mediante el botón Cargar Original</p>",
    "PROMP_ACTUALIZADO":"Prompt actualizado",
    "PROMP_MSG_EXITO":"El nuevo prompt se ha guardado correctamente. Si no funciona bien, prueba volver al prompt original.",
    "PROMP_MSG_ERROR":"Debes almacenar un texto mínimamente válido como prompt. No guardaremos este -prompt- para evitar que la IA se moleste.",
    "PROMP_MSG_REST":"Prompt original restaurado",

    "COFFEE_TITULO":"Dale un café al dev",
    "COFFEE_MSG":"¿HakaBoost te es útil? Invita un café al dev para aliviar el insomnio.",
    "COFFEE_BTN":"Invitar un café",

    "REGISTER_1":"Para seguir, necesitamos algunos datos.",
    "REGISTER_2":"Esto es solo para conocer a nuestros usuarios — nada de spam, lo prometemos.",
    "REGISTER_3":"Nombre",
    "REGISTER_4":"Empresa",
    "REGISTER_5":"Registrar",
    "REGISTER_ERROR":"Todos los campos son obligatorios.",
    "REGISTER_ERROR2":"Debes indicar un mail válido.",
    "REGISTER_COMPLETE":"Registro completo. <br>Para finalizar debes cerrar y volver a abrir HakaBoost (intentaremos hacerlo de forma automática). Si no ocurre, por favor ciérralo.",
    "REGISTER_ERROR_3":"Tenemos problemas para conectar con nuestro cuartel general, reinténtalo. (si tienes VPN, tal vez es un buen momento para desactivarla mientras te registras).",
    "MSG_MAIL_ERROR1":"Debes especificar tu mail en formato válido.",

    "PROMPT_ORG":"Eres un experto en control de calidad cuya tarea es mejorar historias de usuario en Jira. RESPONDE solo con el resultado formateado; no incluyas explicaciones, instrucciones ni repitas este prompt en la salida. INPUT: Recibirás una 'Descripción' (texto en cualquier idioma). Usa ese texto tal cuál. SALIDA (reglas obligatorias): 1. La salida debe comenzar exactamente con la Description original que te doy, en la primera línea, sin cambios, prefijos ni añadidos. 2. A continuación incluye el bloque titulado: Criterios de Aceptación: - Lista solo los criterios de aceptación claros y precisos derivados de la Descripción. - Cada criterio en una línea separada. No agregues explicaciones ni ejemplos. - Crea tantos criterios como determines para cumplir la descripción.  3. Por cada criterio de aceptación listado, incluye al menos un escenario por cada criterio de aceptación generado, en formato gherkin, cada escenario debe incluir lo siguiente: - Los escenarios debes usar las palabras clave de Gherkin SIEMPRE en INGLÉS: Scenario, Scenario Outline, Examples, Given, When, Then, And, But, (otros keywords Gherkin en inglés si aplica). El resto del texto (títulos, pasos, textos) debe estar en el mismo idioma que la descripción (es decir, si la descripción está en ingles, debes hacer todo en ingles. Si la descripción es en español debes crear todo en español, solo dejando en inglés SOLO las palabras claves de gherkin: Scenario, Scenario Outline, Examples, Given, When, Then, And, But; por ejemplo 'Given voy a la web', 'Scenario: ejemplo de una prueba'. - No uses negritas, dobles asteriscos, bloques de código, encabezados Markdown ni símbolos decorativos. Solo texto plano. 5. No añadas nada fuera de esos bloques. No pongas comentarios, no repitas instrucciones, no generes secciones adicionales (por ejemplo: \"Notes\", \"Explanation\", \"Summary\"). 6. No uses símbolos como **, ```, #, ni ningún formato Markdown. Evita comillas decorativas innecesarias. 7. Debes crear al menos 1 escenario por cada criterio de aceptación. FIN. Ahora procesa la descripcion que te doy y genera la salida siguiendo estrictamente las reglas anteriores.",

    "HTML_MAIN_TITLE":"Copiloto de testing HakaLab",
    "HTML_MAIN_COPILOTO":"Copiloto",
    "HTML_MAIN_CONFIGURACIONES":"Configuraciones",
    "HTML_LABEL_ESTADO":"Estado",
    "HTML_LABEL_TITULO":"Título",
    "HTML_BTN_LEERDESCRIPCION":"Leer descripción actual ",
    "HTML_BTN_MEJORARDESCRIPCION":"Mejorar Desc. <i class='fa fa-cogs'></i>",
    "HTML_BTN_CREARTEST":"Sugerir Tests <i class='fa fa-bolt'></i>",
    "HTML_LABEL_DESCR_ORIGINAL":"Descripción original",
    "HTML_LABEL_DESCR_MEJORADA":"Descripción mejorada",

    "HTML_LABEL_MEJORAR_JIRA":"Actualizar Jira <i class='fa fa-rocket'></i>",
    "HTML_LABEL_AVISO_TESTACREAR":"Se crearán los siguientes tests en Jira:",
    "HTML_LAVEL_AVISO_LINK":"Por defecto estos test se enlazan (según tu configuración) al issue actual en Jira. Puedes modificar esto desde la opción 'Issue Principal'",
    "HTML_LABEL_AVISO_MAIN":"Issue Principal",
    "HTML_BTN_CREARJIRA":"Crear en Jira <i class='fa fa-cloud-upload' aria-hidden='true'></i>",
    "HTML_LABEL_AVISODATOS":"<strong>Importante:</strong> Estos datos se utilizan solo localmente.",
    "HTML_LABEL_AJUSTES_IA":"<strong>Ajustes de IA</strong>",
    "HTML_LABEL_IASELECCION":"Selección IA:",
    "HTML_LABEL_SELECCIONMODELO":"Selecciona modelo OpenAI",
    "HTML_LABEL_SELECCIONMODELOGEM":"Selecciona modelo Gemini",
    "HTML_LABEL_AJUSTESIA":"<strong>Ajustes de Jira</strong>",
    
    "HTML_LABEL_USOJIRA":"Utilizado para: 1) Reemplazar la descripción automáticamente por la mejora sugerida por IA. 2) Crear los tests en base a la descripción actual de Jira",
    "HTML_LABEL_TIPOISSUE":"Tipo de Issue a crear",
    "HTML_LABEL_LINKTYPE":"Tipo de Vinculo",
    "HTML_LABEL_XRAYTITLE":"<strong>Ajustes de Xray (Opcional)</strong>",
    "HMLT_LABEL_XRAY_DESCRIP":"Utilizado para: 1) Establecer el tipo de test (Cucumber o Manual) 2) Añadir el gherkin del escenario en los tests tipo cucumber",
    "HTML_LABEL_HAKA":"Visítanos en <a style='color: white;' href='https://hakalab.com/'>https://hakalab.com</a>",
    "MSG_IA_MEJORA_CHROME":"Mejorando la descripción con IA (Chrome built-in AI).",
    "MSG_IACHROME_WAIT":"Por favor espera, esta IA puede tardar unos segundos en responder, no cierres esta vista.",
    "MSG_FIST_INSTRUCTION":"Eres un experto en testing y calidad de software que utiliza Jira.",
    "DESCRIPTION":"Descripción",
    "MSG_CHROMEIA_NOT":"No hay modelos disponibles para CHROME BUILT-IN IA. Revisa la consola para detalles."
}