{
    "Bienvenido": "Bienvenido",
    "INFORMACION": "Información",
    "COMPROBANDO": "Comprobando...",
    "EN_CURSO": "En proceso...",
    "EXITO_SWAL": "Todo bien!",
    "BTN_ENTIENDO": "Entiendo",
    "BTN_GRD_CAMBIO": "Guardar Cambios",
    "BTN_CRG_ORIGINAL": "Cargar Original",
    "BTN_CANCELAR": "Cancelar",
    "DESEAS_CONTINUAR": "¿Deseas continuar?",
    "BTN_CONFIRMAR": "Sí, confirmar",
    "ELIMINAR_TOKEN": "Esto eliminará el token almacenado de OpenAI/Gemini. ¿Estás seguro?",
    "TOKEN_ELIMINADO": "Has eliminado el token exitosamente.",
    "DETECTOR_IA": "Detector de IA <img src='img/dialogo.png' width='34px'>",
    "PERTINENCIA_IA": "Pertinencia <img src='img/revision-positiva.png' width='30px'>",
    "ADVERTENCIA1": "<img src='img/solicitud.png' width='24'> Esta sección te permite conocer que tan probable es que un texto haya sido escrito por una IA.",
    "PLACEHOLDERANALISIS": "Escribe o pega el texto aquí, también puedes seleccionar un texto, presionar el click derecho del mouse y seleccionar -Tell Me Human -> Analyze",
    "ANALIZARTEXT": "Analizar Texto <i class='fa fa-bolt' aria-hidden='true'></i>",
    "HUMANIZAR": "Humanizar <i class='fa fa-user-o' aria-hidden='true'></i>",
    "ADVERTENCIA2": "<img src='img/solicitud.png' width='24'> Esta sección te permite conocer la pertinencia (inicial y aproximada) de un texto. En ningún caso representa una verdad absoluta.",
    "REVISARPERTINENCIA": "Revisar Pertinencia <i class='fa fa-bolt' aria-hidden='true'></i>",
    "PLACEHOLDERPERTINENCE": "Escribe o pega el texto aquí, también puedes seleccionar un texto, presionar el click derecho del mouse y seleccionar -Tell Me Human -> Pertinence",
    "ADVERTENCIAGENERAL": "<span class='badge bg-warning'>Advertencia</span> Interpretar con precaución. Usa este resultado como indicio inicial; revisa el contexto, referencia y estilo antes de sacar conclusiones ",
    "AJUSTESIA": "Ajustes de IA",
    "SELECCIONIA": "Selección de IA",
    "SELECCIONMODELO": "Selecciona el modelo",
    "MENSAJEAJUSTES": "Sobre TellMeHuman",
    "ABOUT": "Los resultados entregados por este complemento son estimaciones basadas en modelos de inteligencia artificial (como Chrome AI, Gemini o OpenAI).\nLas probabilidades y análisis mostrados no constituyen una verificación definitiva de autoría ni una evaluación absoluta del contenido.\nTodos los valores deben interpretarse como indicativos, y pueden variar según el contexto, la calidad del texto y las limitaciones del modelo.\nSiempre se recomienda ejercer criterio humano antes de sacar conclusiones o tomar decisiones basadas en estos resultados.",
    "ERROR_SETTING_IA": "Se ha encontrado un error al setear la IA, por favor cierra el complemento e inténtalo nuevamente.",
    "ERROR_NOTOKEN_GEMINI": "Debes ingresar tu token de Google Gemini.",
    "ERROR_NOTOKEN_OPENAI": "Debes ingresar tu token de OpenAI.",
    "MSG_IA_GEMINI_OK": "Hemos almacenado tus preferencias de Gemini correctamente.",
    "MSG_IA_OPENAI_OK": "Hemos almacenado tus preferencias de OpenAI correctamente.",
    "MSG_IA_CHROME_OK": "Hemos almacenado tus preferencias, utilizaremos Chrome IA.",
    "ERROR_SAVE_IA": "No se pudieron guardar las configuraciones de IA. Intenta nuevamente.",
    "ERROR_NO_TEXT": "Para utilizar esta función debes ingresar un texto.",
    "RAZONS": "Razones",
    "ANALISIS_CORRECTO": "Análisis completado correctamente. Revisa los resultados.",
    "ERROR_RESPUESTA_NOPARSEABLE": "La IA no ha entregado una respuesta en el formato esperado. Por favor, inténtalo nuevamente.",
    "ERROR_RESPUESTA_MAL": "La IA no está disponible o no ha entregado una respuesta en el formato esperado.",
    "ERROR_EN_ANALISIS": "Error al realizar el análisis, por favor reinténtalo. Si el problema persiste puedes intentar reiniciando tu navegador.",
    "DOMINIO": "Dominio",
    "CONFIDENCE": "Confianza",
    "SUMMARY": "Resumen",
    "ISSUES": "A Revisar",
    "CLAIMs": "Afirmación",
    "TYPE": "Tipo",
    "WHY": "¿Porqué?",
    "URGENCY": "Relevancia",
    "SUGGESTIONS": "Sugerencias",
    "CLAIMS_TOCHECK": "Para revisar",
    "NOTES": "Notas",
    "RESULT_HUMAN": "Texto humanizado",
    "REEMPLAZAR": "Reemplazar original",
    "COPIAR": "Copiar",
    "CERRAR": "Cerrar",
    "ANALIZANDO": "Analizando con IA, por favor espera.",
    "CARGANDO": "Manténgase en Línea!",
    "NO_API_GOOGLE": "No hay Google API key configurada. Abre Opciones y pega tu clave.",
    "ERROR_GEMINI1": "Error consultando con Gemini. por favor reinténtalo, valida el modelo y token configurado.",
    "NO_OPENAI": "No hay OpenAI API key configurada. Abre configuraciones y pega tu clave.",
    "ERROR_OPENAI1": "Error consultando con OPENAI. por favor reinténtalo, valida el modelo utilizado y token configurado.",
    "ERROR_MODELO_CHROME": "El modelo no está disponible en este contexto. Debes tener habilitada la Chrome IA (Basada en Gemini Nano)",
    "ERROR_OPENAI_VALIDACION": "No ha sido posible conectar con OPENAI. Verifica el token y el modelo utilizado.",
    "PROBABILIDAD": "Probabilidad de IA",
    "MSG_CAMBIOSIA": "Al cambiar de IA, Modelo o Token, debes guardar los cambios.",
    "ERROR_HTTP": "Error al conectar con el servicio de IA (Puede que no esté disponible temporalmente). Si el problema persiste intenta cambiando de Modelo o verifica que tu TOKEN DE API sea correcto.",
    "MSG_FIRST_IA": "<strong>Estás a punto de utilizar por primera vez la IA Local de Chrome </strong>, si continuas comenzará el proceso de descarga (5 gb aprox.). <br>No debes cerrar el complemento!<br>Este proceso habilitará el modelo Gemini Mini 100% local. <br>Puedes conocer su estado en <strong>chrome://flags/</strong> y en <strong>chrome://on-device-internals/</strong>, más info en https://developer.chrome.com/docs/ai?hl=es-419 <br>Si el proceso tiene un error, tu navegador aún no soporta <strong>o si no quieres utilizar esta característica</strong>, por favor utiliza la opción para Openai o Gemini (cloud). (Si ya tienes descargada y habilitada la IA local de Chrome, ignora este mensaje) <br><br>¿Deseas Continuar?",
    "CONTINUAR": "Continuar",
    "COFFEE_TITULO": "Dale un café al dev",
    "COFFEE_MSG": "¿Tell Me Human te es útil? Invita un café al dev para aliviar el insomnio.",
    "COFFEE_BTN": "Invitar un café"
}